import armosula from "../assets/armosula.jpg";
import mematiane from "../assets/mematiane.png";
import rulesPic from "../assets/rules.jpg";
import mematianeRules from "../assets/mematioane_rules.png";
import OurGame from "../assets/ნიმუში-15.png";

type CardDataTypes = {
  id: number;
  picture: string;
  name: string;
  descriptionOne: string;
  descriptionTwo: string;
  playerAmount: number;
  averageTime: string;
  price: number;
  rules: string;
  rules_pic: string;
};
export const CardData: Array<CardDataTypes> = [
  {
    id: 3,
    picture: OurGame,
    name: "არ მოტყუვდე",
    descriptionOne:
      "არ მოტყუვდე პირველი სამაგიდო თამაშია, რომელიც მთლიანად მედიაწიგნიერებაზე ორიენტირებული ",
    descriptionTwo:
      "თამაშის მიზანია მოთამაშემ დააგროვოს ქულები ყალბი ინფორმაციის ამოცნობით.",
    playerAmount: 3,
    averageTime: "30-50",
    price: 39.99,
    rules_pic: rulesPic,
    rules:
      "მოთამაშეები ორ გუნდად იყოფიან და ირჩევენ სიტყვის პირველ ამხსნელს. ამხსნელის მიზანია, გუნდის წევრებს, განსაზღვრულ დროში, რაც შეიძლება მეტი სიტყვა გამოაცნობინოს, მაგრამ არ გამოიყენოს ის ხუთი სიტყვა, რომლის წარმოთქმაც ახსნის დროს არ მოსულა. დროის ამოწურვის შემდეგ, სვლა გადადის მეორე გუნდზე. წრე დასრულდება მას შემდეგ, რაც გუნდის თითოეული წევრი იქნება არჩეული სიტყვის ამხსნელად. თითო გამოცნობილი სიტყვა, გუნდისთვის ერთი ქულაა. თუ სიტყვის ამხსნელი თამაშისას დაარღვევს წესებს ან გადადებს ბარათს ერთი ქულა მოწინააღმდეგე გუნდს ჩაეთვლება.",
  },

  {
    id: 2,
    picture: mematiane,
    name: "მემატიანე",
    descriptionOne:
      " მემატიანე პირველი ქართული სამაგიდო თამაშია, სადაც მოთამაშეები თამაშის წინააღმდეგ ერთიანდებიან.",
    descriptionTwo:
      " თამაშის მიზანია ისე გადალახოთ 12-ვე ეტაპი რომ არ დაირღვეს საქართველოს ისტორიის ქრონოლოგია",
    playerAmount: 1,
    averageTime: "20-30",
    price: 39,
    rules_pic: mematianeRules,
    rules:
      "მემატიანე Vs მოთამაშები - რაც იმას ნიშნავს რომ თამაში კოოპერატიულია და ყველა მოთამაშე ერთგუნდად ცდილობს მის დამარცხებას 12-ვე ეტაპის გადალახვით. თამაშის თითოეულ ეტაპზე მოთამაშეებს ურიგდებათ იმდენი ბარათი, რომელ ეტაპზეც არიან და ცდილობენ, ხელში არსებული ბარათები, ერთმანეთთან კომუნიკაციის გარეშე, ისე ჩამოვიდნენ, რომ დაიცვან საქართველოს უახლესი ისტორიის ქრონოლოგია. შესაბამისად ისინი იმახსოვრებენ და პასიურად სწავლობენ მე-20 საუკუნეში ჩვენს ქვეყანაში  მომხდარ მნიშვნელოვან ფაქტებსა თუ მოვლენებს. ტურების განმავლობაში მოთამაშეებს ემატებათ სიცოცხლეები და დახმარებები, რაც მათ ეტაპების გადალახვაში ეხმარებათ.",
  },
  {
    id: 1,
    picture: armosula,
    name: "არ მოსულა",
    descriptionOne:
      "არ მოსულა ქართული, ინტელექტუალური სამაგიდო თამაშია, რომელიც ნებისმიერი ასაკის მოთამაშეზეა გათვლილი.",
    descriptionTwo:
      "თამაში 600+ სიტყვისგან შედგება და 8 განსხვავებული სტილით ითამაშება;",
    playerAmount: 4,
    averageTime: "20-30",
    price: 43,
    rules_pic: rulesPic,
    rules:
      "მოთამაშეები ორ გუნდად იყოფიან და ირჩევენ სიტყვის პირველ ამხსნელს. ამხსნელის მიზანია, გუნდის წევრებს, განსაზღვრულ დროში, რაც შეიძლება მეტი სიტყვა გამოაცნობინოს, მაგრამ არ გამოიყენოს ის ხუთი სიტყვა, რომლის წარმოთქმაც ახსნის დროს არ მოსულა. დროის ამოწურვის შემდეგ, სვლა გადადის მეორე გუნდზე. წრე დასრულდება მას შემდეგ, რაც გუნდის თითოეული წევრი იქნება არჩეული სიტყვის ამხსნელად. თითო გამოცნობილი სიტყვა, გუნდისთვის ერთი ქულაა. თუ სიტყვის ამხსნელი თამაშისას დაარღვევს წესებს ან გადადებს ბარათს ერთი ქულა მოწინააღმდეგე გუნდს ჩაეთვლება.",
  },
];
